var E = [ "日", "一", "二", "三", "四", "五", "六" ], A = [ "1月", "2月", "3月", "4月", "5月", "6月", "7月", "8月", "9月", "10月", "11月", "12月" ], N = [ [ "2017-12-25", "圣诞" ], [ "2018-01-01", "元旦" ], [ "2018-02-15", "除夕" ], [ "2018-02-16", "春节" ], [ "2018-03-02", "元宵节" ], [ "2018-04-05", "清明节" ], [ "2018-05-01", "劳动节" ] ], S = {
    0: "出生日期",
    1: "身份证",
    2: "护照",
    3: "学生证"
}, T = {
    "出生日期": 0,
    "身份证": 1,
    "护照": 2,
    "学生证": 3
}, _ = {
    A: "成人",
    C: "儿童",
    X: "携童"
}, P = {
    "成人": "A",
    "儿童": "C",
    "携童": "X"
}, R = {
    PRESALE_MONTH: 2,
    STATION_EXPIRE: 18e5,
    AUTH_EXPIRE: 1296e6
};

module.exports = {
    MONTH: A,
    WEEK_DAY: E,
    HOLIDAYS: N,
    CARDS_TYPE: S,
    CARD_ENUM: T,
    CONSTANT: R,
    PASSENGER_TYPE: _,
    PASSENGER_ENUM: P
};